{"license":"","file_hash":null,"name":"RIE","version":"2021.7.1","description":"RIE Package for MEP Electrical, designed for internal usage at Norconsult AS","group":"310","keywords":["mep","electrical","rie","electro"],"dependencies":[],"host_dependencies":["Revit"],"contents":"RIE_ActiveView - Returns active view in current document., RIE_AllElementsOfFamilyType - Retrieves all element of input family type, also works for links., RIE_AllLoadedFamilies - Retrieves a Family list containing all families loaded in input project document. (If no input  a list of families will be retrieved from current document), RIE_AllRelatedFamilyTypes - Input a family type, and get all the family types that belongs to the family., RIE_BatchIFC - Forked from Bakery. Modified to work with view inputs.\r\n\r\nInput directory path and 3D view prefix., RIE_BBoxByElements - Creates a boundingbox from a set of elements, RIE_BBoxCenterPoint - Returns centerpoint of boundinbox., RIE_BboxFromBboxString - Can convert BoundingBox list element that has been converted to string back to a BoundingBox, RIE_BBoxFromPlanView - Retrieves boundingbox from active view based on viewrange settins, RIE_BBox_StretchZ - Stretch the boundingbox in Z directions., RIE_BBox_Translate - Translate boundingbox by distance and direction, RIE_BCFZipReader - Reads contents of BCFzip. Adjusted for use in Norconsult. Input directorypath of unzipped BCFzip folder., RIE_BoundingBoxBy3DView - Outputs the boundingbox of input 3D view, RIE_BoundingBox_Expand - Expands the input boundingbox by given input amount, RIE_BuildinCategoryFromCategory - Returns the OST builtincategory from input category., RIE_ChamferedWire - Input from and to element, with connection points and vertices in order. Input wire type as well., RIE_CircuitsFromPanel - Retrieves all Circuits from input panel element, RIE_ClosestPointByTwoListsOfPoints - Finds each \"points1\" closest \"points2\", RIE_CopyElementsFromViewToView - Copies elements from view to view., RIE_CopyViewRangeFromViewToView - Copy view range from views to views., RIE_CreatePanelSchedule - Creates PanelSchedule from input Panel elements. Uses default Template if no template is input., RIE_CreateSheets - Create sheets with inputs; Sheet Name, Number and Titleblock, RIE_Curve_Rotation_XY - Find the XY Rotation component of a line, RIE_Curve_Rotation_XZ - Find the XZ rotation component of a line, RIE_DeconstructPoint - Deconstructs points into their X, Y and Z values. Idea stolen from Lunchbox's equivalent node., RIE_DistinguishableColors - Just a simple list of distinguishable colors., RIE_DrawLinesToNearbyPoints - Input Two lists of points and from each point in list 1 there will be drawn a line to each point in list 2 which is closer than the input value in list 3, RIE_DrawWires - Draws wires for the Electrical System in the input view., RIE_DropNthItemInSublists - Input list of indexes to be dropped from each sublist., RIE_ElectricalCategories - Retrieves all categories relevant for electrical installations., RIE_ElementsByView - Selects elements that are visible in input view. Forked from Marc.\r\nTags : Elements by view, RIE_ElementsInBBox - Returns elements contained by input BoundingBox., RIE_ElementsIntersectingElement - Retrieves all elements intersecting with input element. Can be linked elements as well as local elements., RIE_ElementsOfCategoryByView - Retrieves all elements of an input category in input views., RIE_ElementsOfCategoryInBBox - Returns elements of input category contained by input boundingbox. Category needs to be representable as a builtincategory, but input from the category node., RIE_ElementsOfCategoryInDocument - Returns all elements of category contained in input Autodesk.Revit.DB.Document, RIE_ElementsOfCategoryIntersectingElement - Retrieves all elements of input category that intersects with input element. Can also be linked elements. If Category is not input, all categories will be checked., RIE_ElementsOnSheet - Input Sheet and retrieve all elements. This nodes get all elementIds by performing a deletion of the sheet, then undoing the transaction whilst retrieving all deleted elementIds, then retrieves all the elements that were restored.\r\nTherefore the sheets you input must be closed in the UI, or they cannot be deleted, hence this node will output null., RIE_ElementToWorksetByWorksetName - No description provided, RIE_Element_SpaceAndRoom - Gets the Spaces and Rooms containing the input  list of Elements, RIE_EquipmentFromCircuits - Returns Equipment connected to input circuit, RIE_ExportCurvesToAutoCAD - Forked from LinkDWG package, RIE_FilterOutBusyElements - Filters out elements that are borrowed by other localfile users., RIE_GetAllUserWorksets - Retrieves all user created worksets in the document., RIE_GetAllViews - Retrieves all view elements that are not View Templates in the model., RIE_GetAllViewTemplates - Gets all view templates. Forked from SpringNodes, RIE_GetCategoriesFromString - Returns Categories by Name, RIE_GetCircuitFromPanelScheduleView - Input PanelScheduleView Element, and input integervalue of circuit., RIE_GetElementConnector - No description provided, RIE_GetImportInstancesInView - Gets Imported instances like CAD links in input view., RIE_GetOpenedAndLinkedDocuments - Returns all opened and linked revit documents, RIE_GetPanelAndEquipmentFromCircuit - Gets panel circuit is connected to, and Elements connected to the circuit., RIE_GetPanelFromPanelScheduleView - Gets The panel corresponding to the input PanelScheduleView, RIE_GetPanelScheduleViews - Gets Panel Schedules Views, RIE_GraphicOverrideElementsInViews - Overrides elements in views with input color for both lines and fill. Requires you to have a fill pattern named \"Solid fill\", RIE_If - An If node that keeps list structure, empty lists and so forth., RIE_Increment_Rotation - Rotates input elements by input angle in degrees (CCW if positive). Angle can be single input or list input at equal size of elements' input list.\r\nTags : Rotate Groups, Rotate Model Groups, Rotate Element, Rotate Family Instance., RIE_IndexDuplicateStrings - Indexes input list of strings with a running index for each set of duplicates, RIE_IndexOf - Returns a sublistlist with all indexes for each item., RIE_InsertItemAtIndex - Inserts Items into list at given index, RIE_IntersectionsFromListOfLines - Outputs points on which lines in a list intersect, RIE_ItemAtIndexByMaximumKey - Retrieves maximum item based on key list value input., RIE_ItemAtIndexByMinimumKey - Filter a list based on another list of values, where the index of the highest \"key value\" is used to get the input item at the same index., RIE_LevelAtPoint - Input point, and retrieve level below where the point resides., RIE_LineElement_Filter_Only_Inside - Works together with bimorph elementsintersect node for line elements. Filters on line elements that are only the same, or part of eachother with almost equal line direction, RIE_LinkDocFromLink - Retrieves link Document element from link element., RIE_LinkedElementCategory - Returns Category of Linked Element, RIE_LinkedElementsByElementID - Get linked elements by element ID and link instance, RIE_LinkedFamilyType - Returns FamilyType for linked elements., RIE_Math_MRound - Rounds given numbers to nearest input multiple, RIE_Math_MRound_Ceiling - Rounds input value to nearest multiple, but ceilinged (Round up), RIE_Math_MRound_Floor - Rounds input value to nearest multiple, but floored (Round down), RIE_ModelComparison_AllChanges - Node for comparing models. Copied from the brilliant Data-Shapes package to have available for the modified RIE.ModelComparison.ByView node., RIE_ModelComparison_ByView - Modified version of Data-Shapes Model Comparison node. Compares two versions of a model by input views, and reports on new and deleted elements., RIE_ModelComparison_GeometryChanges - Node for comparing models. Copied from the brilliant Data-Shapes package to have available for the modified RIE.ModelComparison.ByView node., RIE_ModelComparison_ParameterChanges - Node for comparing models. Copied from the brilliant Data-Shapes package to have available for the modified RIE.ModelComparison.ByView node., RIE_MoveCircuit - Moves Circuitnumber To input circuit number row. New Circuit number row has to be unoccupied., RIE_MoveCircuitToFirstOpen - Moves input circuit to first open in input starting series., RIE_OpenMyDynamoFolder - Opens your local dynamo folder in windows explorer, RIE_Orient3DViewToSelectedFace - Orients the active 3D view to the selected face. First select the element or link you want to select a reference face from, then select the face., RIE_PlaceViewOnSheet - Places Views, Schedules or Legends into sheets., RIE_Point_SpaceAndRoom - Gets Spaces and Rooms containing the point from the input points list., RIE_PowerElements - Powers list of elements, RIE_powerType_Communication - Powertype Communication, RIE_powerType_Controls - Powertype Controls, RIE_powerType_Data - Powertype data, RIE_powerType_FireAlarm - Powertype Fire Alarm, RIE_powerType_NurseCall - Powertype Nurse Call, RIE_powerType_PowerBalanced - Powertype PowerBalanced, RIE_powerType_PowerCircuit - Powertype PowerCircuit, RIE_powerType_PowerUnBalanced - Powertype PowerUnBalanced, RIE_powerType_Security - Powertype Security, RIE_powerType_Telephone - Powertype Telephone, RIE_powerType_UndefinedSystemType - Powertype UndefinedSystemType, RIE_RemoveNulls - Removes Nulls from list, and outputs a clean list as well as a list of indices that contained nulls in input list, RIE_ReplaceItemsAtIndices - Replaces items at indices with input value. One value for each index needed., RIE_ReplaceNullsWith - Replaces nulls in input list with input replacement object., RIE_ResetGraphicOverrideElementsInViews - Resets Graphic overrides for all input elements in all input views., RIE_RevisionsOnSheet - Returns Revisions that are placed on a sheet., RIE_SelectElementById - Forked from Clockwork, RIE_SelectLinkedElement - Prompts you to select link, then select linked element. Returns Link element instnace, Link instance and Link Transform., RIE_SelectNLinkedElements - Select N amount of elements from selected link., RIE_SelectPanel - Assigns Electrical System (cirucit) to a panel and assigns the circuit an automatic running index number, RIE_Set3DViewSectionBox - Sets sectionbox of 3D view and if the view is open, also zooms to its extents., RIE_SetRevisionDate - Sets revision date for input revision, RIE_SetRevisionDescription - Sets description of input revision, RIE_SetRevisionIssued - Sets input revision to issued or not issued based on true/false input, RIE_SetRevisionIssuedBy - Sets IssuedBy parameter for input Revision, RIE_SetRevisionIssuedTo - Sets IssuedTo parameter for input Revison, RIE_SetRevisionNumbering - Set revision numbering to Numeric, Alphanumeric or None., RIE_SetRevisionVisibility - Sets Revision Visibility based on input string. Cloud and Tag, Tag or None., RIE_SetRevitSelection - Input elements to select in Revit model, RIE_SheetsContainingRevision - Returns all sheets in the model that contains the input revision, RIE_SpaceBoundaryLines - Outputs Boundarylines of input Space elements, RIE_SpaceTag.Space - Retrieves the Space which the Space Tag represents. Also works with Room Tags, retrieving corresponding rooms.\r\nTag : RIE_RoomTag.Room, RIE_TagsReconcileHosting - Runs the ReconcileHosting Postable Command in the Revit UI, and represents a report of orphaned tags that needs to be looked at., RIE_TimeRightNow - Uses time module from python to get current time., RIE_ViewType - Outputs the type of view input to the node, RIE_WaitFor - Waits for \"GO input\" before passing through main input, RIE_Wall_GetDirections - Returns Vectors for Wall direction, Walls interior side normal, Walls exterior side normal, RIE_Wall_GetDoorsAndWindows - Retrieves Doors and Windows hosted by input wall element, RIE_Wall_GetLocations - Returns Lines for Exterior, Interior, Center and CoreCenter of a wall, RIE_WorksharingInfo - Gets Worksharing Info Tooltip from Elements ., RIE_WorksharingInfoFromLink - Gets worksharing info from input link instance and elementset, RIE_zfill - zfills input string with input amount of characters.","engine_version":"2.6.1.8850","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"","contains_binaries":true,"node_libraries":[]}