{"license":"","file_hash":null,"name":"Modelical","version":"1.3.7","description":"Reviewed for Dynamo 1.3_Set of tools to improve your productivity. From auto finishes generation to improved documentation. You can find the user guide of each node and examples at https://www.modelical.com/en/modelical-package-for-dynamo/","group":"Modelical","keywords":["views","templates","productivity","walls","finishes","documentation","modelical","mep","pipe","duct","color","delete","workset","sheet"],"dependencies":[],"contents":"3D Views by Workset - Makes a new 3D view for each workset in the model, It leaves only one workset visible., Add Next Revision - Add the next revision to the selected sheets. Switch to manual run to use this node., Angle Between Vectors - Returns the angle that forms a vector with another reference vector, clockwise and counterclockwise. The vectors are calculated in the XY plane., Apply ViewTemplate - Apply ViewTemplate(s) to selected view(s)., CeilingPlan with ViewTemplate - Create a new ceiling plan based on a level, with a ViewTemplate applied., Change duct_pipe fitting level - Change the level of a pipe/duct fitting(s) to another one, modifying also its offset value., Color By Parameter - Override elements graphics by param value without making view filters. You can also reset them with this node. If a \"Solid fill\" pattern is found, it will be applied., Delete LinePatterns - Delete all the imported Line Patterns from CAD files., Delete Unused Filters - Delete all unused filters in your project file, Delete Unused ViewTemplates - Delete all unused ViewTemplates in your file, except for 3D view templates, as they cannot be converted to work with Dynamo yet., Disable Analytical Model - Enable or disable the analytical model (True = Disable | False = Enable), Disallow/Allow Join in STR Framing - Disallow or allow join condition at Structural Framing ends (True = Disallow | False = Allow), Duplicate view with ViewTemplate - Duplicate selected views as many times as View Template names and apply them., FloorPlan with ViewTemplate - Create a new floor plan based on a level, with a ViewTemplate applied., Get Element Rotation - Get the rotation of a family instance whose location is a point., Get Scope Boxes - Get all the Scope Boxes in the project, Get Views By Type - Get all views in the project classified by type, OverrideColorInView Full - Improve the OOTB tool in Dynamo by adding a Fill Pattern option. \"Solid fill\" will be applied by default., Point similarity - Check if a point is similar to another, with a tolerance, Remove Underlay Views - Remove all the underlay views in a project. Works for R16 and below, Room and Tag Location Centering - Move room location point and its tag to its centroid. If centroid is located outside the room, location point stays at its origin coords., Room Location Centering - Move room location point to its centroid. If centroid is located outside the room, location point stays at its origin coords.\r\n\r\nIt's a good tool for auto-tagging., Room Tag To Room Location - Move RoomTags to the location point of the room, Schedules Exporter - Batch export of schedules to CSV files. You can select the schedules with the nodes \"Element Types\">ViewSchedule + \"All Elements of Type\"., Scope Boxes to Views - Create as many dependent view as needed to selected views to apply selected Scope Boxes., Space and Tag Location Centering - Move space location point and its tag to its centroid. If centroid is located outside the space, location point stays at its origin coords., Space Location Centering - Move space location point to its centroid. If centroid is located outside the space, location point stays at its origin coords., Space Tag To Space Location - Move Space Tags to the location point of the space, Vector similarity - Check if a vector is similar to other, with a tolerance., Wall Finishes by Room - Place wall finishes with the info contained in room parameters, Wall inserts - Get all the inserts in a wall (windows, doors and openings).","engine_version":"1.3.1.1736","engine":"dynamo","engine_metadata":"","site_url":"http://blog.modelical.com/modelical-package-for-dynamo/","repository_url":"","contains_binaries":true,"node_libraries":["Package.customization, Version=0.0.0.0, Culture=neutral, PublicKeyToken=null"]}