{"license":"","file_hash":null,"name":"Synthesize toolkit","version":"12.7.5","description":"Supports Dynamo 2.x, Created by Karam Baki to Automate many repetitive tasks in Revit, divided into sections in the extra folder.\r\n\r\nBrowse to the extra folder in Dynamo Player to use the Main Toolkit features (K-Join, Parameters, K-Laser....etc)\r\nYou will find set of remarkable tools, such as K-Attractor, which helps in parameteric computational designing in Revit based on Attractors, and others nodes for randomizing based on multiple set of factors, and many more tools to automate your daily workflow, and increase your productivity, in design aspects and construction documents.","group":"Geometry, Analyse","keywords":["adaptive","patterns","satsync","revit","parametric","automate","computational"],"dependencies":[{"name":"Dynamo Future File","version":"0.0.1"},{"name":"DynamoIronPython2.7","version":"2.5.0"}],"host_dependencies":[],"contents":"8 Points Adaptive Family By Geometry - 8 Points Adaptive Family By Geometry, Adaptive Component By Circle or Ellipse - Adaptive Component By Circle/Ellipse, Adaptive Family Orientation Type - Adaptive Family Orientation Type (Along With Other Useful Information, Adaptive Match Coordination - Adaptive Match Coordination, AdaptiveComponent.ByParametersOnCurveReference Fixer - AdaptiveComponent.ByParametersOnCurveReference Fixer, Advanced Elements Filter - Advanced Elements Filter, Advanced Parameter Set With Translate - Advanced Parameter Set With Translate, Advanced Parameter Set - Advanced Parameter Set, Advanced Parameter Type Translate - Advanced Parameter Type Translate, AL.Current Document - Retrieves Current Document, AL.Duplicate Item Indices - Searches an input list for duplicate entries and lists their index numbers. Couple with Get From List to delete duplicates from a list., AL.FamilyInstance.FamilyType - This node will return a  Family Type of a given Family Instance. If no Family Type can be assigned to a Family then it will return Null. , AL.FamilyInstance.TotalTransform - This node returns a Total Transform of a family instance., AL.Get All Dimension Types - This node will query all of the available dimension styles (this includes linear as well as arc, circle etc). , AL.Get Built In Parameter - This node will take an input of a built in parameter name and element to return that parameters value. , AL.Get Documents - Queries all linked Revit files and retrieves their Name, LinkInstance and Document properties., AL.Get Host Element - This node will retrieve a host element from hosted element. Ex. feed in door, get wall., AL.Get Level by Name - This node will retrieve a Revit Level Element by its name. , AL.Get Line Style by Name - This node will return a line style object by its name. Line styles can be either Drafting or Model Line Property. , AL.Get Unplaced Groups - This node will retrieve all unplaced groups in the model., AL.Group Curves - This node will take any input of flat list of curves and group them into sublists containing \"joinable\" curves that is continous curves. They might form closed curves or open curves. Use PolyCurve.ByJoinedCurves to convert output groups of curves into single PolyCurves, AL.Id to Element - Selects elements in a model from id input (ElementId, string, integer or GUID), AL.Material.MaterialAssetElement - This node retrieves a Material Asset Element from Material. If such is not defined it will return an Invalid Element Id (-1), AL.Material.SetMaterialAssetByAssetId - This node will set the material asset by asset id. Please make sure that the two input lists match in length. , AL.Material.SetMaterialAssetByMaterial - This node will copy a material asset element from source Material to a list of target materials. It esentially makes all materials inherit its Rendering Appearance. Useful for \"clay\" renderings. , AL.Room.AtPoint - This node will attempt to retrieve a room at a given point in model. , AL.Select Detail Lines by Style - This node will select all model lines in the revit project by a line style name. , AL.Select Model Lines by Style - This node will select all model lines in the revit project by a line style name. , AL.Set BuiltIn Parameter - This node will take an input of a built in parameter name and set that parameter to given value for given elements. , AL.String.Contains - This node takes a list of strings and checks if any string contains a matching string from filter input. , AL.Transform Origin - This node will query an element for its Transform (Coordinate System) and then return its Origin point. , AL.Transform.ToPoint - This node takes a Transform and an input point that will be translated by the Transform. , Alert Popup With Wait - Popup a message dialog in Revit, Alert Popup - Popup a message dialog in Revit, All Surfaces or Surface Filtering - All Surfaces or Surface Filtering, AS.[&] Geometry.SplitByTools - Split one piece of geometry (other than a polysurface) by multiple tools, AS.[&] List.GroupByKey - Sort the items of a list into groups (sublists) based on the corresponding items of a reference list.  Example: The list {A,B,C,D,E} with the reference list {1,anyWord,4,anyWord,1} will be grouped into lists as { {A,E}, {B,D}, {C} } and the unique references will be {1, anyWord, 4}., AS.[&] List.PickByKey - Take items from a list whose keys match a given set of choose values. Items and their corresponding keys are output in the order in which they are requested by the set of choose values.  As needed, items may appear multiple times in the output list or not at all.  Choose values that do not correspond to a key value produce a null selection, and all values not matched to a key are given as a third output., AS.[&] List.SortByKey - Sort a list (or lists) according to the order specified by the key list., AS.[&] Overkill ByCurves - Create polycurves from an unordered list of curves., AS.[&] PointList.SortAzimuthally - Sort points azimuthally (like sorting numbers around a clock face) in a plane.  Points are ordered about the origin of the plane, proceeding from the positive x-axis of the plane in a counter-clockwise direction about the plane normal vector., AS.[&] PolyCurve.ByCurves With Failures Sandbox - Create polycurves from an unordered list of curves., AS.[&] PolyCurve.ByCurves With Failures - Create polycurves from an unordered list of curves., AS.[&] PolyCurve.ByCurves With Surface Laundry - Create polycurves from an unordered list of curves., AS.[&] PolyCurve.ByCurves - Create polycurves from an unordered list of curves., AS.[&] PolySurface.SplitByTools - Split a single polysurface with multiple tools., AS.[&] Vector.ProjectToPlane - Find the projection of the vector to the specified plane., Auto Build Intersecting Surfaces On Surfaces - Auto Build Intersecting Surfaces On Surfaces, Auto Element Parameters Associate - Auto Element Parameters Associate, Auto Family Parameters Associate With Types - Auto Family Parameters Associate With Types, Auto Family Parameters Associate - Auto Family Parameters Associate, Auto FBX Proxy - Auto FBX Proxy, Auto Pads By Rooms - Auto Pads By Rooms, Auto Walls By Surfaces - Auto Walls By Surfaces, B4S.Quad Panels (Design Script) - Generates quad panels on a surface. The panels surfaces are defined with DesignScript, for use with Project Fractal., Batch Elements Bounding Box - Batch Elements Bounding Box, Better Geometry.ImportFromSAT - Better Geometry.ImportFromSAT, Better Solids - Better Solids, BK.Any Null in List - returns boolean true if a null is found, BK.bv All Indices Of that can handle Nulls - forked from spring nodes, BK.bv Get Category Name - forked from Blackbox, BK.bv If Equal Return Index - forked, BK.bv Remove Nulls - forked from Lunchbox, BK.Collect all FamilyInstance using Element Types - should get model family instances, BK.Convert Category Name to Built In Category Name - You must use List.Map to convert list of Category Names to list of Built In Names, BK.Create Parts for Linked Elements - currently does not handle multiple instances of Link, BK.Element List check for Inplace Families - pythonic, BK.Find Nearest Revit Level for a Given Z value - No description provided, BK.Get All Views - taken from archi-lab, BK.Get Categories from Elements - \"List Unique Categories Present in Set of Elements\" is better. This one uses Blackbox Get.CategoryName and Get Categories (designed to use document category list), BK.Get Categories with Builtins - Lists: Category Names, internal api definition, Built In Category Names, Ids, BK.Get Link Instance and Element Ids from LinkElementId Object - No description provided, BK.Get Linked RVT Documents - No description provided, BK.Get LinkElementIds from Parts - No description provided, BK.Get System Type List by Category Name - takes category name as string, BK.Get System Types as List - uses HostObjAttributes parent class to collect, BK.Get Type List for this project - No description provided, BK.If Equal Return Index using IndexOf - No description provided, BK.List All Views - not including sheets, BK.List of float double to list of Int - no decimals, BK.Natural Sort List of Strings - No description provided, BK.Popup Message Box - from Dynamo Player samples, BK.Preflight for Section View Creation - No description provided, BK.Remove List from List by Item not Value - remove the items in ListA from the items in ListB and return whats left, BK.Remove Points with Duplicate XY Values - cleanup tool for points into Revit topography, BK.Replace Item if True - takes two lists, plus a boolean list. If the boolean list says True, list1 item is replaced by list2 item, BK.Replace Point Z Value - No description provided, BK.Report on Inplace Families - No description provided, Borders Panels - Map Revit Panels, Bounding Box Intersected Pairs Combination - Elements' Bounding Box Intersected Pairs Combination, Building Pad Type Selector - Building Pad Type Selector, BVN.Door.RenumberByRoom - Renumbers a door's mark value based on the room it is located in. If there is no 'To' room, it will default to the 'From' room, BVN.IsString - Checks a list for input types and returns boolean value based on a string, BVN.List.SortSublists - Sorts sublists, BVN.ModelGroup.TypeCollector - Returns all the types (not instances) from all model groups in the project, BVN.Room.CentreLocation - Moves room to the centroid of the room. If the centroid is outside of the room boundary, the room will remain in its current position. Based on the custom node by Modelical., BVN.RoomTag.MoveToRoomLocation - Moves room tags to the room location point. Use the Room.CentreLocation node first before using this node. Based on the script by Modelical., BVN.View.Phase - Returns the current view's phase , BVN.Window.RenumberByRoom - Renumbers a window's mark value based on the room it is located in. If there is no 'To' room, it will default to the 'From' room., CallDynamoFutureFile - CallDynamoFutureFile, CallIronPython - CallIronPython, CH.AutoReturnValue - Return the only item in the list or list itself if more than 1 items are in list, CH.Point.Flatten - Project point's Z coordinate to certain number, CH.Point.GetConvexHull - Generate convex hull vertices of group of points, CH.Room.GetRoomTag - Get Roomtags of input rooms, CH.Wall.GetWallType - Get the walltype of wall, Change Family Category - Change Family Category, Clockwise Points Sorter - Clockwise Points Sorter, Combined Bounding Box of Elements - Combined Bounding Box of Elements, Confirm Element Position By Geometry - Confirm Element Position By Geometry, Contour Loft Surfaces With PolyCurves Function - Contour Loft Surfaces With PolyCurves Function, Contour Model Create With Helper Curves - Contour Model Create, Contour Model Create - Contour Model Create, Contour Model Lines - Contour Model Lines, Convert Curve to Nurbs Curve With Resolution - Convert Curve to Nurbs Curve With Resolution, Coordinate System Adaptive Curves Prepare - Coordinate System Adaptive Curves Prepare, Coordinate System Adaptive Divided Path Prepare - Coordinate System Adaptive Divided Path Prepare, Coordinate System Adaptive Surface Prepare - Coordinate System Adaptive Surface Prepare, Coordinate System Global Z Then Host XY - Coordinate System Global Z Then Host XY, Coordinate System Smart Flip - Coordinate System Smart Flip, Coordinate Sytem Rotate By Z Axis - Coordinate Sytem Rotate By Z Axis, Coordination Family Management - Coordination Management, Coordination Family Update - Coordination Family Update, Copy Element Overrides - Copy Element Overrides, CopyElementsFromLinksByCategory - CopyElementsFromLinksByCategory, Create 3D or Select It - Create 3D or Select It, Create Floors By Boundary Lines (Smart) - Create Floors By Boundary Lines (Smart), Create Material If Not Existed - Create Material If Not Existed, Create Pads By Boundary Lines (Smart) - Create Floors By Boundary Lines (Smart), Create Pads By Level and Curves Loops - Create Pads By Level and Curves Loops, Create Roofs By Boundary Lines (Smart) - Create Floors By Boundary Lines (Smart), CSV Read for Space Planner - This node reads a csv file for space planner, Curve.ExtrudeAsSolid Fixer - Curve.ExtrudeAsSolid Fixer, Curve.Offset Fixer - Curve.Offset Fixer, CurveByPoints.ByReferencePoints Fixer - CurveByPoints.ByReferencePoints Fixer, CurveLoop.Group.ByAngle - CurveLoop.Simplify.ByAngle, CurveLoop.Simplify.ByAngle - CurveLoop.Simplify.ByAngle, Curves Offset To Revit Compatibility - Curves Offset To Revit Compatibility, Curves to Nurbs Curve - Curves to Nurbs Curve, Curves to Quad Surface - Understand Quad Faces, Cut Elements - Cut Elements, Cut Solid with Solid - Cut Solid with Solid, Cut Solid with Void - Cut Solid with Void, CW.+1 - Increments a value by 1, CW.All Elements of Family Type+ - Unlike the built-in  node, this node retrieves all placed instances of a given loadable *or* system family type, CW.All Family Types Of Category - Gets all family types/symbols of a given category in the model  (does *not *work for system families), CW.Application.Version - Retrieves the name, version and build of the current Revit application., CW.AreaSeparator.FromCurve - Creates area separation lines from geometry curves. , CW.Character.FromNumber - Converts a number into a character (where 1 = A, 2 = B, ... , 27 = AA, 28 = AB etc.)., CW.Curve.SuperJoin - Join all connected curves into Polycurves even they are intersected, CW.DetailLine.FromCurve - Creates a detail line based on a given curve, CW.Directory.ContentsAll - Unlike the built-in node Directory.Contents, this node browses a directory recursively and returns all relevant files contained in subfolders as well., CW.DisplayUnit.ToInternalUnit - Converts a value from a given display unit to Revit's internal unit, CW.DividedPath.SetIntersect - Adds an intersect to a divided surface, CW.DividedSurface.AddIntersect - Adds an intersect to a divided surface, CW.Document.BuiltInParameters - List all the available BuiltInParameters, CW.Document.ProjectInfo - Gets the project information., CW.Document.Views - Gets all views in the document - except for 3D view templates (as long as this bug is not fixed: https://github.com/DynamoDS/Dynamo/issues/2970), CW.Door.Rooms - Gets the rooms that are connected by a given door, CW.Duplicate Family Types - Duplicates an element type, CW.Dynamo.Version - Retrieves the version of the active Dynamo application, CW.Element.ByID - Gets the Revit element(s) for a list of IDs (or a single ID). Optionally retrieves elements from linked documents as well., CW.Element.FromDynamoSurface - Returns the underlying Revit element of a given face, CW.Element.ID - Gets the ID(s) for a list of Revit elements (or a single element) - unlike the built-in Element.Id node, this node returns an actual Revit Element ID and *not* a number, CW.Element.JoinGeometry - Joins two model elements (if possible). Only works inside the project environment., CW.Element.Level - Gets an element's level, CW.Element.Location - Returns the location of an element as an XYZ (or if it's line-based the start and end point of the line), along with some booleans to help filtering the results. Use this for some element types (e.g. walls or lines) that do not work with the built-in Get Family Instance Location node. , CW.Element.Materials.Areas - Retrieves materials areas from given element, CW.Element.Materials - Retrieves all materials from a given element, CW.Element.Materials.Volumes - Retrieves materials volumes from given element, CW.Element.OverrideTransparencyInView - Overrides the transparency of an element in a given view, CW.Element.ParameterExists - Checks if an element contains a parameter of a given name, CW.Element.PermanentlyIsolateInView - (Permanently) isolates elements in the given view, CW.Element.TemporarilyIsolateInView - (Temporarily) isolates elements in the given view, CW.FamilyDocument.FamilyParameters - Retrieves all family parameters from the active family document. PLEASE NOTE: This node will only work in a family document!, CW.FamilyInstance.AddCoping - Adds a coping (cut) to a steel beam, CW.FamilyInstance.RemoveCoping - Removes a coping (cut) from a steel beam, CW.FamilyInstance.SetType - Changes the family type of a given family instance to the specified type, CW.FamilyInstance.SubComponents - Retrieves all subcomponents of a given family instance, CW.FamilyParameter.Properties - Retrieves all properties of a given family parameter. PLEASE NOTE: This node will only work in a family document!, CW.FamilyType.CompoundStructureHasVariableLayer - Checks if the compound structure of a given floor or roof type contains a variable layer., CW.FamilyType.CompoundStructureLayers - Retrieves the compound layers of any layered family type (wall types, roof types, floor types etc.), CW.FamilyType.SetCompoundLayerMaterial - Sets the material of a specified compound layer of a given family type (only applies to family types that have a compound structure, e.g. walls, floors etc.)., CW.FamilyType.SetCompoundLayerWidth - Sets the width of a specified compound layer of a given family type (only applies to family types that have a compound structure, e.g. walls, floors etc.)., CW.Floor.SlabShapeByPoints - Transform a slab shape based on a list of XYZs. PLEASE NOTE: Will reset any previous edits on the slab shape., CW.Group.FromElements - Creates a group from a list of Revit elements, CW.Group.Members - Retrieves the members of a group, CW.InternalUnit.ToDisplayUnit - Converts a value from Revit's internal unit to a given display unit, CW.Level.Plane - Retrieves the plane of a given level, CW.List.AlphabeticalSequence - Creates a list of the first N letters of the alphabet  (where 1 = A, 2 = B, ... , 27 = AA, 28 = AB etc.)., CW.List.AnyFalse - Returns true if any item in a list of booleans is false., CW.List.AnyTrue - Returns true if any item in a list of booleans is true., CW.List.ChopByLengths - Turns a list into a list of lists with sublists of varying lengths., CW.List.DropLastItem - Drops the last item from a given list., CW.List.EqualSublistLengths - Trims all given lists to the length of the shortest list, CW.List.FilterBySublistLength - Filters out all sublists that do not have the specified length, CW.List.GroupListOfListsByKey - Groups a list of lists by one of its keys, CW.List.IsNotEmpty - Just the inversion of the built-in Is Empty List node., CW.List.MatchWithKeyValues - Matches a list with a given set of keys and returns the values corresponding to the keys, CW.List.ReplaceEmptyLists - Replaces all empty lists within a given list with a substitute, CW.List.ReplaceItemAtIndex+ - Replaces the item at a given index (or list of indices) of a list by another item, CW.List.ReplaceNull - Replaces all null values within a given list with a substitute, CW.List.SortListOfLists - Sorts a list of lists by one of its sublists, CW.List.SublistLengths - Gets the lengths of all sublists in a given list of lists., CW.List.WithLeadingZeroes - Adds leading zeros to a sequence of numbers, CW.Math.AlmostZero - Returns a feasable computational tolerance to zero (1.0e-9 or a billionth of 1) for use in calculations. More background info: https://github.com/DynamoDS/Dynamo/issues/879, CW.Math.IsEvenNumber - Checks if a number is even., CW.Math.IsMultipleOf - Checks if A is a multiple of B., CW.Math.IsOddNumber - Checks if a number is odd., CW.Math.RoundToPrecision - Rounds a number to a specified precision, CW.Mesh.FaceVertices - Gets the vertices of each face of a given mesh, CW.ModelCurve.Type - Gets the type of a given model curve, CW.Normal.CorrectOrientation - Inverts normal A if its inversion is closer to normal B, CW.Paneling.BuildTriangularSublists - Creates sublists of three items each from a list based on given indices, shift and reverse settings and offset., CW.Paneling.DropLastRowAndColumn - Drops the last row and column from a UV field, CW.Paneling.GridFromFace Without Flatten - Returns UV coordinates, XYZ coordinates and normals for a face with UV subdivision, CW.Paneling.GridFromFace - Returns UV coordinates, XYZ coordinates and normals for a face with UV subdivision, CW.Paneling.Hexagonal - Creates groups of points from a list of UVs or XYZs for the placement of hexagonal panels. The placement pattern can be reversed (boolean) and shifted (integer)., CW.Paneling.MakeTriangles - Reduces each sublist to a list of three items specified by the indices in the pattern., CW.Paneling.ShiftPlacementAndReverse - Shifts (integer) and reverses (bool) a given list, CW.Paneling.TriangularFlatDiagonal - Creates groups of points from a list of UVs or XYZs for the placement of triangular panels. The placement pattern can be reversed (boolean) and shifted (integer)., CW.Paneling.TriangularFlatMirrored Dynamo 2 - Creates groups of points from a list of UVs or XYZs for the placement of triangular (diagrid) panels. The placement pattern can be reversed (boolean) and shifted (integer)., CW.Paneling.TriangularFlatMirrored - Creates groups of points from a list of UVs or XYZs for the placement of triangular (diagrid) panels. The placement pattern can be reversed (boolean) and shifted (integer)., CW.Paneling.TriangularSubpattern - Subcomponent of the Triangular Pattern From Grid node., CW.Passthrough - Forces a sequential order of execution. The node wired into the output of the Passthrough node will be executed *after* the node wired into the waitFor input (e.g. important for some Revit operations). The value of the passThrough input will be passed on to the node wired into the output port of the Passthrough node., CW.PerspectiveView.OrientToEyeAndTargetPosition - Sets the orientation of a given perspective view based on a given eye and target position, CW.Plane.ByBestFitFromFace - Creates a plane from face, CW.Point.RoundDownToPrecision - Rounds a point coordinate *down* to a specified precision, CW.Point.RoundUpToPrecision - Rounds a point coordinate *up* to a specified precision, CW.Polygon.ContainmentTest+ - A less accurate method that should perform faster than the built-in node for large data sets., CW.ReturnListOrSingleValue - If the unknown item is not a list but rather a single item, only the first item of the list (input \"seq\") will be returned., CW.RevitFace.FromDynamoSurface - Returns the underlying Revit face of a given surface, CW.RevitFaceReference.FromDynamoSurface - Returns the underlying Revit face reference of a given surface, CW.Roof.SlabShapeByPoints - Transform a slab shape based on a list of XYZs. PLEASE NOTE: Will reset any previous edits on the slab shape., CW.Roof.SlabShapeHasBeenModified - Checks if the shape of a roof slab has been modified with the shape editing tools, CW.Room.Boundaries - Gets a list of all boundary elements of a given room or area, CW.Room.State - Returns the state of a room, i.e. is it placed, unplaced, redundant or not enclosed., CW.RoomSeparator.FromCurve - Creates room separation lines from geometry curves. , CW.ScopeIf+ - A (hopefully) more robust implementation of ScopeIf. Tests a single boolean and returns a value accordingly., CW.SelectionSet.ByElements - Creates a selection set of the given elements. Note that if a selection set of the given name already exists in the model, its contents will be replaced. Also, if the selection set is already applied as a view filter, the view filter will have to be manually updated in the visibility / graphic overrides. DO ***NOT*** USE IN AUTOMATIC MODE!, CW.SelectionSet.Elements - Retrieves all elements stored in a selection set, CW.Solid.ByUnion+ - The OOTB node Solid.ByUnion occasionally fails when trying to merge solids with almost adjacent faces. This node will return the minimum amount of joined solids possible in such cases instead of returning null., CW.String.BinaryFromBooleans - Creates a binary string from a list of booleans, CW.String.CompileRegularExpression - This is a helper node for setting certain flags for the Regular Expresssion nodes.\r\nhttp://ironpython-test.readthedocs.org/en/latest/howto/regex.html, CW.String.FindRegularExpression - Returns all occurences of a regular expression within a string (or list of strings). The syntax for regular expressions is explained at\r\nhttp://ironpython-test.readthedocs.org/en/latest/howto/regex.html, CW.Surface.FilterByOrientation - Sorts surfaces in three lists based on their orientation (vertical, horizontal up & horizontal down) and also returns three corresponding lists of booleans., CW.Surface.IsPlanar - Checks whether a face is planar, CW.Surface.Vertices - Returns all vertices of a given surface, CW.TurnIntoList - Turns an element (or a nested list) into a flat list, CW.UnitType.DisplayUnitType - Retrieves the display unit type for a given unit type. , CW.UV.ConvexHull2D - Computes the convex hull of a given set of UV coordinates based on the monotone chain algorithm, CW.UV.PruneDuplicates - Prune UVs to exclude duplicates within a given tolerance, CW.UV.Swap - Swaps U and V coordinates, CW.Vector.IsOrthogonalToVector - Checks if two vectors are orthogonal to each other, CW.Vector.IsParallelToPlane - Checks if a given vector is parallel to a given plane, CW.Vector.ZAxisNegative - Returns an XYZ of 0,0,-1, CW.View.ConvertTemporaryHideIsolateToPermanent - Convert all temporary hidden elements or categories to permanently hidden in the given view., CW.View.DisableTemporaryHideIsolate - Disables the temporary hide/isolate for the given view (if set), CW.View.ResetElementOverrides - Resets all overrides for an element in a given view, CW.View.Type - Returns the type of a given view, CW.View.Type.NoCeiling - Returns the type of a given view, CW.View3D.IsLocked - Checks if a given view is locked, CW.Wall.Flip - Flips the  orientation of a given wall - DO ***NOT*** USE IN AUTOMATIC MODE, CW.WallType.Function - Retrieves the Function property of a given wall type, CW.Window.Rooms - Gets the rooms that are connected by a given window, DA.Dynanimate Numeric Parameter And Camera Position With Fixed Target - Animates the camera of a perspective view around a fixed target., DA.Dynanimate Numeric Parameter - Animates parameter values of a selection of elements., DA.DynanimatorFunction Numeric Parameter And Camera Position With Fixed Target - Helper function for Dynanimate Camera Position With Fixed Target, DA.DynanimatorFunction Numeric Parameter - Helper function for Dynanimate Numeric Parameter, DA.DynanimatorNestedFunction Numeric Parameter And Camera Position With Fixed Target - Nested function used in DynanimatorFunction Numeric Parameter And Camera Position With Fixed Target, DA.ElementsOfCategory(InclLinks) - Collects all elements of a Category including elements in all links, Debug Python No Message - Debug Python, Debug Python - Debug Python, Default Linestyles Name Revit Compatiblity - Default Linestyles Name Revit Compatiblity, DelaFix - Delaunay Pattern Fix by Karam Baki, DelaFixDesignFace - Delaunay Pattern Fix On Face Design by Karam Baki, Delete Duplicated Elements From List - Delete Duplicated Elements From List, Detect Levels of Points - Detect Levels of Points From Family Refine Levels and Offset, Determine Intersecting Curves - Prepare K-Paneling Manual Lines UV, Dimensions Leader Position - Dimensions Leader Position, Dimensions Start End Points - Dimensions Start End Points, DisableReferencePlanes - DisableReferencePlanes, DividedPaths to Surfaces - Reference Planes to Surfaces, DividedSurface.Without Layout - DividedSurface.Without Layout, DM.Fix Point.ByCoordinates Range - Dummy Node to fix the modelling range warning, Does Intersect Fixer - Does Intersect Fixer, DS.All Elements In View(s) - Retrieves all visible element in a view or a set of views, DS.Export to FBX - Exports 3D views to FBX format, Dyna Split - Dynamo Split Node, DynaForm Complex Surface - Creates Nurbs Surface by Points in a Smart way, DynaForm Complex T-Surface Bridge - Bridge Between Faces, DynaForm Complex T-Surface - Creates Nurbs Surface by Points in a Smart way, DynaForm Generate Points From Surface - Generate UV Grid From Surface, DynaForm Simple Surface - Dyna Form Simple Surface, DynaForm Solid Form with Importing - Closed Form with Dynamo and importing into Revit directly, DynaForm Solid Form - Closed Forms DynaForm, DynaForm T-Spline Import - Import to Revit, DynaLine From UV Grid - Create Dynamo Lines From UV Grid, DynaLine - Create Dynamo Lines, Dynamo and Revit Versions - Dynamo and Revit Versions, Dynamo Geometry To Revit Compatibility - Dynamo Geometry To Revit Compatibility, DynaPoints Match Coordination - Adaptive Match Coordination, Element.BoundingBox Fixer - Element.BoundingBox Fixer, Element.Geometry DWG Fixer - Element.Geometry DWG Fixer, Element.Geometry Fast - Element.Geometry Fast, Element.Geometry Fixer Legacy - Element.Geometry Fixer Legacy, Element.Geometry Fixer - Element.Geometry Fixer, Element.Geometry With Detail Level - Element.Geometry With Detail Level, Element.SetParameterByName Fixer - Element.SetParameterByName Fixer, Elements.Curves Fixer - Elements.Curves Fixer, Elevation Analysis - Elevation Analysis, Expect Solid Only - Expect Solid Only, Extract UV Revit Lines - Extract UV Revit Lines, Face to Mass Updater - Face to Mass Updater, Family and Type Selector - Family and Type Selector, Family Assosiate Parameter - Family Assosiate Parameter, Family Create Parameter - Family Create Parameter, Family Parameters Randomize - Family Parameters Randomize, Family Refine Levels and Offset - Family Refine Levels and Offset, Family SAT Sync - Fusion 360 SAT Sync, Family Set Formula Parameter - Family Set Formula Parameter, Family Set Value Parameter - Family Set Formula Parameter, Family Smart Rotation - Family Smart Rotation, Fetch Whole Body - Fetch Whole Body, Filter Adaptive Component FamilyInstances - Filter Adaptive Component FamilyInstances, Filter Transparent Materials - Filter Transparent Materials, Fix Room Heights Data - Fix Room Heights Data, Flatten Nurbs Surfaces - Flatten Nurbs Surfaces, Flip Parameter Values - Flip Parameter Values, Flip Section - Flip Section, Flip Y Axis - Flip Y Axis, FlipWorkplane - FlipWorkplane, Floor Opennings Prepare - Floor Opennings Prepare, Floors By Model Lines - Floors By Model Lines, Floors By Subregion - Floors By Subregion, Floors Offset And Separate By Pads - Floors Offset And Separate, Floors Offset And Separate Function - Floors Offset And Separate Function, Floors Offset And Separate - Floors Offset And Separate, Force Surface to Planar - Force Surface to Planar, Format Numbers - Increase Decimals, Fractle Tree Lines - Fractle Tree Lines, Fusion 360 Family Import - Fusion 360 SAT Sync, Generate Intersecting Pairs Sublists - Generate Intersecting Pairs Sublists, Generate Lines (Helper for Smart Arcs Detection) - Generate Lines (Helper for Smart Lines), Generate Lines (Smart with Auto compatibility with Revit) - Generate Lines (Smart with Auto compatibility with Revit), Generate Lines by AutoSplit - Generate Lines by AutoSplit, Generate Lines Without Join - Generate Lines, Generate Lines - Generate Lines, Generate Model or Detail Lines - Generate Scaled Lines, Generate Offset or Fillet Lines - Generate Offset or Fillet Lines, Generate Outlines By Surface Selection - Generate Outlines By Surface Selection, Generate Scaled Lines - Generate Scaled Lines, Generate Selection Filter - Generate Selection FIlter, Generate Sequenced Points - Generate Sequenced Points, Generate T-Lines - Generate T-Lines, Generate T-Sequenced Points - Generate T-Sequenced Points, Geometry and Vector of Model Curves and Curve By Points With Helping Surfaces - Geometry and Vector of Model Curves and Curve By Points, Geometry and Vector of Model Curves and Curve By Points - Geometry and Vector of Model Curves and Curve By Points, Geometry Bottom Mid Point - Geometry Bottom Mid Point, Geometry of Model Curves and Curve By Points - Geometry and Vector of Model Curves and Curve By Points, Geometry.ExportToSAT Fixer - Geometry.ExportToSAT Fixer, Get Curtain System Grids and Sorted Faces - Get Curtain System Grids Only, Get Curtain System Grids Only - Get Curtain System Grids Only, Get Curtain System or Divided Surface - Get Curtain System or Divided Surface, Get Curtain Wall Geometry - Get Curtain Wall Geometry, Get Divided Surface Smooth Lines By Surfaces Selection Old - Get Divided Surface Smooth Lines By Surfaces Selection, Get Divided Surface Smooth Lines By Surfaces Selection - Get Divided Surface Smooth Lines By Surfaces Selection, Get Divided Surfaces of Surfaces - Get Divided Surfaces of Surfaces, Get Document Name - Get Document Name, Get Element From Divided Surface - Get Element From Divided Surface, Get Family and Type Name By Family Instance - Get Family and Type Name, Get Family Instances of Divided Surface - Get Family Instances of Divided Surface, Get Pure Surfaces of Flat Detected Adaptive Components - Get Pure Surfaces of Flat Detected Adaptive Components, Get Pure Surfaces of Flat Divided Surface - Get Pure Surfaces of Divided Surface, Get Stairs Bottom Surfaces - Get Stairs Bottom Surfaces, Get View Range Settings - Get View Range Settings, Group Adjacent Surfaces - Join Adjacent Surfaces, Group Curves By Surfaces - Group Curves By Surfaces, Group Family Editor Elements By Volumes - Group Family Editor Elements By Volumes, Group Files By Prefix - Group Files By Prefix Separator, GroupModelLines - GroupModelLines, Groups Batch Placement - Revit Links Batch Placement, Groups Batch Rotation - Revit Links Batch Placement, Helix to Curves - Helix to Curves, HelixAtCurve - No description provided, Honeycombs Paneling - Honeycombs Paneling, HOT.Add Filter to View - Add Filter to View, HOT.AllowDisallowWallJoinAtEnd - Allow/Disallow Wall Join At End.\r\nTrue=Allow.WallJoinAtEnd\r\nFalse=Disallow.WallJoinAtEnd, HOT.CutGeometry Solid with Solid - No description provided, HOT.CutGeometry - No description provided, Hot.Dynamo Color to Revit Color - No description provided, HOT.Get Active View Filter - Get all Filter, HOT.Get All Filter By Document - Get all Filter, HOT.Get All Filter - Get all Filter, HOT.Get Revit ActiveView - Active View, HOT.Get Revit Selection - No description provided, HOT.Index of item - Index of Item on List, HOT.Join Type (Miter) - No description provided, HOT.JoinGeometry - Join Selected Geometry, HOT.Revit ID - No description provided, HOT.Select in Revit - Select Elements in Revit, HOT.SwitchJoinGeometry - Join Selected Geometry, Hot.View Set Element Overrides - No description provided, Hot.View Set Filter Overrides - No description provided, HOT.View Set Filter Visibility - Set View Filter Visibility, Is Topography Subregion - Is Topography Subregion, Join Adjacent Solids - Join Adjacent Surfaces, Join Adjacent Surfaces Legacy - Join Adjacent Surfaces, Join Adjacent Surfaces - Join Adjacent Surfaces, Join or Extract By Angle Range - Join or Extract By Angle Range, Join Single Element With Surroundings - Join Single Element With Surroundings, K-Adaptive Component By Coordinate System - A Better Adaptive Component Placement Method Using Coordinate System, K-Array By Levels - K-Array By Levels, K-Array By Workplanes Organic - K-Array By Workplanes on Organic Faces, K-Array By Workplanes - K-Array By Workplanes, K-Array For Groups - K-Array By Levels, K-Array For Revit Links - K-Array By Levels, K-Array Points Only - K-Array By Levels, K-Attractor Circles Preview - Preview Node for K-Attractor, K-Attractor For Family Types - K-Attractor For Family Types, K-Attractor For Groups - K-Attractor For Family Types, K-Attractor For Materials - K-Attractor For Family Types, K-Attractor For Parameters - K-Attractor By Selection, K-Attractor Sorter - K-Attractor Sorter, K-Clash - K-Clash, K-Family Insert - K-Family Insert, K-Flatten Family - K-Unhost Family, K-Interference Check - K-Interference Check, K-Join All In One By Interference Check File - K-Join All In One, K-Join All In One - K-Join All In One, K-Join Single List - K-Join Single List, K-Join Two Categories - K-Join Two Categories, K-Laser Engine - K-Laser Engine, K-Paneling Data Export - K-Paneling Data Export, K-Paneling Data Import - K-Paneling Data Import, K-Paneling External Process Function - K-Paneling External Process Function, K-Paneling Framing Only Sandbox - Create Frames By Surfaces, K-Paneling Framing Only - Create Frames By Surfaces, K-Paneling Sandbox - K-Paneling, K-Paneling - K-Paneling, K-Pattern Family - K-Pattern Family, K-Plan Function - K-Plan, K-Plan - K-Plan, K-Rig Family - K-Rig Family, K-Rig Forms - K-Rig Forms, K-Rig Profile - K-Rig Profile, K-Section Dimensions - K-Section Dimensions, K-Section Filled Region - K-Section Filled Region, K-Section Lines Prepare - K-Section Lines Prepare, K-Section - K-Section, K-Super Adaptive Paneling - K-Super Adaptive Paneling, K-Super Boders Paneling - K-Super Map Revit Paneling - Custom, K-Super Diamond Paneling - K-Super Diamond Paneling, K-Super Diamond Revit Paneling - Multiface - K-Super Map Revit Paneling - Custom, K-Super Faces Outlines Paneling - K-Super Quad Master Paneling, K-Super Geodesic Master Paneling - K-Supe Geodesic Master Paneling, K-Super Honeycombs Paneling - K-Super Honeycombs Paneling, K-Super Map Revit Paneling - Auto - K-Super Map Revit Paneling - Auto, K-Super Map Revit Paneling - Custom - K-Super Map Revit Paneling - Custom, K-Super Quad Master Paneling - K-Super Quad Master Paneling, K-Super Quad Paneling Chopped - K-Super Adaptive Paneling, K-Super Quad Paneling - K-Super Adaptive Paneling, K-Super Staggered Paneling - K-Super Staggered Paneling, K-Super Triangle Complex Paneling - K-Super Triangle Complex Paneling, K-Super Triangle Diagonal Paneling - K-Super Triangle Diagonal Paneling, K-Unhost Family - K-Unhost Family, LB.LunchBox Curve to Arcs by Division - Converts a curve to tangent arc segments, LB.LunchBox Diamond Grid by Face - Create a Diamond XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LB.LunchBox List Matcher - Compares a List A against a List B and matches length of List A.  If ListA > ListB, ListB will be extended.  If ListA < ListB, ListB will be truncated., LB.LunchBox Mass Addition - Returns the total value of a list of numbers., LB.LunchBox Multi Face Diamond Grid by Face - LB.LunchBox Multi Face Diamond Grid by Face, LB.LunchBox Quad Grid by Face - Create a quadrangular XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LB.LunchBox Random Numbers - Generates a list of Random numbers using a domain, amount, and seed., LB.LunchBox Room Element Collector - Collects rooms from the Revit document, LB.LunchBox Staggered Grid by Face  - Create a Staggered XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LB.LunchBox Triangle Grid by Face - Create a Triangular XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LB.LunchBox Wave - Creates a parametric Wave surface, Levels to Surfaces - Reference Planes to Surfaces, LF.Elements.RandomizeParameter - Set an element's instance parameter to a random value between a range specified by the minimum and maximum parameter., LF.FamilyInstance.RandomRotation - Rotates the angle of the family instance a random amount (between 0 and 360)., LF.IndexOf.Equals - Returns the indices of items in list B that are equal to items in list A., LF.List.MatchLength - Cycle a list to match the length of the first list., LF.Math.RandomIntegerMin - Creates a list of random integers between a given minimum and maximum value, LF.Point.Random - Creates a random set of points within a set of boundary cuves. Tolerance specifies the minimum distance between points., LF.Point.RandomAmount - Creates the specified amount of random points within a set boundary curves. Tolerance specifies the minimum distance between points., LF.Point.XYZ - Get the X, Y, and Z components of a Point, LF.Point.ZRange - Get all Z components and the minimum and maximum Z components from a list of Points., LF.Points.SameXY - Find points that share the same XY (or overlap in plan). Used for creating Topography., LF.Points.SortByDistance - Sort a list of points based on their distance from a specified point, LF.Points.SortByXY - Sort list of points based on its X and Y coordinate values. In order to sort correctly, points must be rounded (default value is 3 decimal points)., LF.SlabShape.AdjacentPoints - Get the adjacent slab shape points between two adjacent Floors., LF.SlabShape.MatchPoints - Match the adjacent slab shape points from Floor 1 to Floor 2. (requires Clockwork package), LF.SlabShape.Points - Get the XYZ points of any slab shape Roof or Floor., Lines Auto Dimensions - Lines Auto Dimensions, Lines Join and Flatten - Joins Lines and Flattens them to Nearest Level, Lines Segmentation By Distance - Lines Segmentation By Distance, List Files In Path - List Files In Patch, List.FirstItem Fixer - List.FirstItem Fixer, List.GetItemAtIndex Fixer - List.GetItemAtIndex Fixer, List.LastItem Fixer - List.LastItem Fixer, List.MaximumItem Fixer - List.MaximumItem Fixer, Load Family Documents - Load Family Documents, Location Of Any Element With Coordination System - Location Of Any Element, Location Of Any Element - Location Of Any Element, MAD.Change Family Type - Changes family type of a family by passing in an Element and type id of the type we want to change it to. , MAD.View.SetCropBoxCurves - Input views and lists of curves to set the view crop regions, Map Revit Custom Panels - Map Revit Panels, Map Revit Panels - Map Revit Panels, Mass Floor Lines Intersects - Mass Floor Lines Intersects, Mass Split Updater - Mass Split Updater, Mass Split - Mass Split, MetersInput - MetersInput, MillimetersInput - MetersInput, Mirrored Elements Detect - Mirrored Elements Detect, MOD.DisallowAllow Join in STR Framing - Disallow or allow join condition at Structural Framing ends (True = Disallow | False = Allow), MOD.Get Element Rotation - Get the rotation of a family instance whose location is a point., MOD.Get Views By Type - Get all views in the project classified by type, MOD.Wall Finishes by Room - Place wall finishes with the info contained in room parameters, Model Curve Build Checker - Model Curve Build Checker, Model Curve By Pair Points - No description provided, Model Line or Detail Line From (Model Line) - Model Line or Detail Line From (Model Line), Move Dimension Text to Middle - Move Dimension Text to Middle, Nurbs Curves Re-Creation - Nurbs Curves Re-Creation, Odd or Even - Odd or Even, Override All Elements in All of the given Views - Override All Elements in All of the given Views, Override Material Assets - Override Material Assets, Pads By Lists of Curves - Pads By Lists of Curves, Paneled Divided Surface or Not - Paneled Divided Surface or Not, Parameter Copy - Parameter Copy, Parameters Selector - Parameters Selector, Parts Level Auto Fix - Parts Level Auto Fix, Patterns Voider Generator - Patterns Voider Generator, Place Families By Upper Smart Points - Place Families By Upper Smart Points, Place Family By Room Center - Place Family By Room Center, Place Family By Surfaces - Place Family By Room, Planes and  Curve of Divided Path - Planes and  Curve of Divided Path, Points Refine Levels and Offset - Family Refine Levels and Offset, Polygon.ByPoints Fixer - Polygon.ByPoints Fixer, Prepare Clean Pattern - Prepare Clean Pattern, Prepare K-Paneling Divied Paths UV - Prepare K-Paneling Divied Paths UV, Prepare K-Paneling Manual Lines UV - Prepare K-Paneling Manual Lines UV, Prepare K-Paneling Manual Lines - Prepare K-Paneling Manual Lines, Prune.TolleranceFixer - Prune Duplicates Fixer, Pull Onto Surface Or Plane - Pull Onto Surface Or Plane, Python All Elements In Active View - Python All Elements In Active View, Python All Elements In All Document - Python All Elements In All Document, Python Dispose - Python Flatten, Python Empty 2 False - Python Null 2 Empty, Python Empty 2 Null - Python Null 2 Empty, Python Empty 2 String - Python Null 2 Empty, Python Filter List From Another List - Find Intersections In Lists, Python Flatten - Python Flatten, Python Null 2 Empty - Python Null 2 Empty, Python Null 2 String - Python Null 2 String, QU.ViewDuplicate - Duplicate views with given names., QU.ViewPorts Schedules Alignment - This note relocate viewports positions for given sheets , according template sheet viewports positions including schedules., Quad or Adaptive Points On Surface Prepare - Quad or Adaptive Points On Surface Prepare, RA.String.RemoveFromBegin - Remove characters from the beginning of a string by a given amount, RA.String.RemoveFromEnd - Remove characters from the end of a string by a given amount, Ramps Auto Detail Lines - Ramps Auto Detail LinesRamps Auto Detail Lines, Ramps Faces By SAT File - Ramps Faces By SAT File, Random Letters - Random Letters, Randomize Material Parameters - Randomize Material Parameters, Randomize Parameters - Randomize Parameters, Recreate Surfaces - Recreate Surfaces, Recurring Group Elements Fetch - Recurring Group Elements Fetch, Reference Plane Perpendicular On Face - Reference Plane Perpendicular On Face, Reference Planes to Surfaces - Reference Planes to Surfaces, Reference Point Orientation Fix By Coordinate System - Reference Point By Coordinate System, Reference Point To Coordinate System - Reference Point To Coordinate System, ReferencePlane.ByLinesAndVectors - New Reference Plane By Lines and Vectors, ReferencePlane.ByStartPointEndPoint Fixer - Fixer Node to Hide Error, ReferencePlanesByModelElementsorAdaptiveFamily - ReferencePlanesByModelElementsorAdaptiveFamily, Refine Families - Refine Families, ReFusion IT Export - This Node exports the fixed Geometry to a SAT file with Sufix (LinkMeToRevit) (Karam Baki), ReFusion IT Import - This Node Fixes the orientation of the SAT file from Fusion 360 To Revit (Karam Baki), ReLoft Faces - Balance Faces, Remap Parameters - Randomize Parameters, Remove Duplicated Solids - Remove Duplicated Solids, RemoveCoincidentPlanes - RemoveCoincidentPlanes, Renumber Adaptive Components - Renumber Adaptive Components, Restore Material Assets - Restore Material Assets, Revit Extrusion By Curve and Sketchplane - Revit Extrusion By Curve and Sketchplane, Revit Extrusion By Imported Geometry - Revit Extrusion By Imported Geometry, Revit Links Batch Placement - Revit Links Batch Placement (Link Reference 0 = Origin | 1 = Shared | 2 = Basepoint | 3 = Cenetered), Revolve Direct - Revolve Direct, RH.Collector.DetailGroupByName - This will collect all instances of a model group by given name., RH.Collector.ModelGroupByName - This will collect all instances of a model group by given name., RH.Element.GetJoinedElements - This will obtain the elements joined to the input element., RH.Element.SetPinnedStatus - Will set the element to either pinned or not pinned. True is pinned, false is unpinned. For multiple elements use List.Map, RH.FilePath - Provides a file path option for use with Dynamo Player., RH.Output.Clean - This will return a single value or list from one input., RH.Pick Model Element - This offers a single selection of a model element. Created for Dynamo Player usage., RH.Pick Model Elements - This node offers a pick method for selecting elements in Revit., RH.ReferencePlane.GetCurvesInView - This will obtain the geometric curves of the reference plane in a given view. Revit 2016+, RH.RemoveListFromList - This node essentially \"subtracts\" the contents of List B from List A to produce a new list with the unique items., RH.Rhythm.RenumberGridsByCurve - This node will renumber grids in order of curve drawn through them. Select either letters or numbers. (Alphanumeric coming soon), RH.Rhythm.Toggle - Toggle that offers two outputs. Created for Dynamo 0.8.1 because of changes to the \"IF\" node, RH.Select Grids By Curve - This will select Revit grids by the input Revit curve,, RH.UI.ColorPicker - This node allows the user to choose a color via the Revit API color selection dialog. For Revit 2017 +, Room Smart Height Detection - Room Smart Height Detection, Rooms To DirectShape - Rooms To DirectShape, Rooms Upper Surfaces - Rooms Upper Surfaces, Rotate By Custom Point - Rotate By Custom Point, SAT To Topography - SAT To Topography, Scale Up and Down Revit Factor - Scale Up and Down Revit Factor, Scale Updater - Scale Updater, Scatter Elements - Scatter Elements, Searcher - Searcher, Section By Surface - Section By Surface, Select All Not Keynoted - Selet All Not Keynoted, Select All Not Tagged - Select All Not Tagged, Select All Topography From Topography - Select Subregions From Topography, Select By Reference Planes Intersects with Family and Type - Select By Reference Planes Intersects with Family and Type, Select Elements By Spline Intersects - Select Elements By Spline Intersects, Select Elements in Links by ID - Select Elements in Links by ID, Select Topography From Subregion - Select Topography From Subregion, Sequenced String Numbers Generate - Sequenced String Numbers Generate, Shift Adaptive Components - Shift Adaptive Components, Simple ByElement Id Selection - Simple ByElement Id Selection, Slope Analysis - Slope Analysis, Surfaces Border Offset - Surfaces Border Offset, Smart Explode - Smart Explode, Smart Family Type Change - Smart Family Type Change, Smart Geometry Scale - Smart Geometry Scale, Smart Planar Divided Surface - Smart Planar Divided Surface, Smart Points By Rooms - Smart Lights By Rooms, Smart Points By Surfaces Refinery Function - Smart Points By Surfaces Refinery Function, Smart Points By Surfaces - Smart Points By Surfaces, Smart Prepare Divided Surfaces Geometry - Smart Prepare Divided Surfaces Geometry, Smart RFT Path - Smart RFT Path, Smart Surface Offset With Reloft - Smart Surface Offset With Reloft, Smart Surface Offset - Smart Surface Offset, Smart Thicken - Smart Thicken, Smart Translate For K-Rationalize - Smart Translate For K-Rationalize, Smart Voronoi Generator Sandbox - Smart Voronoi Generator, Smart Voronoi Generator - Smart Voronoi Generator, Smooth Curves - Smooth Curves, Solid By Curve Slicer - Solid By Face Reference Slicer, Solid By Divided Path Slicer - Solid By Face Reference Slicer, Solid By Face Reference Slicer - Solid By Face Reference Slicer, Solid Slicer - Slicer, Solid.By Loft Fixer - Solid.By Loft Fixer, Solid.ByUnion Fixer - Solid.ByUnion Fixer, Sort Adaptive By Reference Points - Sort Adaptive By Points, Sort Geometry By Guides - Sort Loft Profiles According to Guide, SP.AutoSATGeometry.ByElements - You must provide a valid family template path that will be used for all input geometry objects. The project units(and not the templates) will be used to determine the size of the output geometry.\r\nThe provided category will be used only if the family template supports it. If not, the default template category will be used instead.\r\nLikewise, the family material(provided as a string) will be set only if a material with that name exists in the template. If not, the default material will be used instead (\"By Category\").\r\nFor void cuts, the material settings will be ignored.\r\nThe Subcategory name is an optional input. If you'd like to skip assigning a Subcategory to any new instance, simply use null.\r\nThe node expects a unique family name for each geometry object. The rest of the input lists will be processed as if the node lacing is set to longest., SP.Beams.FixExtents - Detects all beams from the input list with broken extents(actual length - cut length <  margin) and attemts to correct them., SP.Collector.ElementSketch - Get the actual sketch lines of a sketch based element (floor, ceiling, modified wall, etc.) . You can optionally fetch the matching model curves, however this might prove comptationally heavy on larger data sets., SP.Collector.ElementSketch.Original - Get the actual sketch lines of a sketch based element (floor, ceiling, modified wall, etc.) . You can optionally fetch the matching model curves, however this might prove comptationally heavy on larger data sets. Does not work with elements from linked files., SP.Collector.FamilyInstances - Collects placed family instance elements from the document that match the name. Partially mathing elements are collected as well. If no matches are found, a list of all isntance names will be output., SP.CurveLoop.Simplify With Ratio - Attempts to simplify an open or a closed curve loop by connecting straight separate line segments into a single line., SP.CurveLoop.Simplify - Attempts to simplify an open or a closed curve loop by connecting straight separate line segments into a single line., SP.DirectShape.ByGeometry - Convert the input geometry to DirectShape element inside the Revit document.  It supports solids or surfaces. It is based on an alternative process that uses a SAT import and can produce smooth surfaces. Each created DS will have a unique type. Make sure that each input geometry has a unique name. You can either feed a single category for all geometries or a unique category for each geometry - the node's lacing is set to longest by default. The default category is \r\nGeneric Models., SP.Doc.CopyFromLinkInstance - The node will use the total transformation of the link instance to copy the input elements into the local document., SP.Element.Unjoin - Unjoins the element(s) in the second list from the primary input element., SP.ErrorReport.Parse - K-Warnings Read, SP.FamilyInstance.ByGeometry - You must provide a valid family template path that will be used for all input geometry objects. The project units(and not the templates) will be used to determine the size of the output geometry.\r\nThe provided category will be used only if the family template supports it. If not, the default template category will be used instead.\r\nLikewise, the family material(provided as a string) will be set only if a material with that name exists in the template. If not, the default material will be used instead (\"By Category\").\r\nFor void cuts, the material settings will be ignored.\r\nThe Subcategory name is an optional input. If you'd like to skip assigning a Subcategory to any new instance, simply use null.\r\nThe node expects a unique family name for each geometry object. The rest of the input lists will be processed as if the node lacing is set to longest., SP.FamilyInstance.BySAT - You must provide a valid family template path that will be used for all input geometry objects. The project units(and not the templates) will be used to determine the size of the output geometry.\r\nThe provided category will be used only if the family template supports it. If not, the default template category will be used instead.\r\nLikewise, the family material(provided as a string) will be set only if a material with that name exists in the template. If not, the default material will be used instead (\"By Category\").\r\nFor void cuts, the material settings will be ignored.\r\nThe Subcategory name is an optional input. If you'd like to skip assigning a Subcategory to any new instance, simply use null.\r\nThe node expects a unique family name for each geometry object. The rest of the input lists will be processed as if the node lacing is set to longest., SP.Filter.ByCategoryName - Filters the input elements by their category name. You can input multiple category names., SP.Filter.ByClassName - Filters a list of objects by the object's class name. Note that Dynamo elements belong to different classes than their Revit counterparts. Use the Object.Class node to check an object's class., SP.FloorOpening.ByCurves - Create hosted floor opeinngs through the input floors. The second input is a list of sub-lists of the boundary curves., SP.List.DropFirstLast - Removes the first and last items from the list, SP.List.ItemAtIndex+ - Identical to the built in node but works with negative indices, SP.List.MergeByBoolMask - Merge two lists by a boolean mask list. The true count in the mask should be the same as the length of the true list and vice versa for the false list., SP.List.Subpairs - Pair up each list item with the next one and drop the list item., SP.Mesh.ToPolySurface - Converts a Dynamo mesh to a polysurface. Uses multithreading - optimized for 4 cores., SP.NullAllIndicesOf - list all of the indices of a list that match the specified value. Capable of handling null values, part of the SmartCopyMonitor workflow., SP.Number.ToString - Converts the input number(s) to string. You can optionally limit the number of digits., SP.PlanarFace.FixDomain - Corrects the surface domain of a 3 or 4 point planar face extracted from Revit., SP.Points.PruneDuplicates+ - An alternative to the built in node, that performs faster at the price of loosing the order of the points. All floating point valies are rounded to the nearest 4 decimal points. You can optionally remove duplicate Z values by setting \"keepDuplicateZ\" to false., SP.PolyCurve.ArcChamfer - Symmetrically chamfers the corners of the polycurve by the designated distance and close with tangent arcs., SP.PolyCurve.Chamfer - Symmetrically chamfers the corners of the polycurve by the designated distance, SP.PolyCurve.Fillet+ - Fillet a polycurve in its plane. Unlike the built in node, this works in both in the CW and the CCW direction., SP.SelectFaces+ - Select multiple faces from inside the Revit UI. Be sure to press \"Finish\" once done. Unlike the built-in node, face references of instances will be added sucessfully and you'l get the pick points. You can use a Boolean toggle to refresh your selection., SP.Watch+ - This node that serializes the input information and presents it in a resizable text window., Square Crop Region Curves By Surface - Square Crop Region Curves By Surface, ST.Element.3DCropViewTopBaseOffset - create 3d view for each element and crop view, ST.Element.GetAllElementsFromLinkedFile - ST.Element.GetAllElementsFromLinkedFile, ST.Element.GetFromLinkedFile - Get elements from link document instance based on category, ST.Element.GetParts - Get parts for the elements from Input. Returns Parts and Parent elements, ST.Element.MakeParts - Create Parts from valid elements, ST.List.FilterByString - Filter a list by a string match, ST.Parts.Getparents - Returns parents of selected Parts, ST.Tool.AssemblyViews - Create Sheet and Views for Assembly instances, ST.Tool.CreateAssembly - Create an Assembly for each element, ST.Tool.Eraser - Try to delete any element from project, ST.Tool.GetRevitSelection - Get the selection from the Revit UI, use boolean action to refresh when selection must be updated, ST.Tool.RenameAssembly - Rename Existing Assembly - doesn't work yet at Assembly creation (transaction related, WIP)\r\nBeware: same length Lists, ST.View.ViewPortBoxCenter - Get ViewPort Box center point, ST.Viewport.SetBoxCenter - API class, Stabilize Custom Lines For K-Paneling Function - Stabilize Custom Lines For K-Paneling Function, Street Lines Prepare - Street Lines Prepare, String.ToNumber Fixer - String.ToNumber Fixer, Subregions Batch Create - Subregions Batch Create, Suface.IsPlanarOrCurved - Suface.IsPlanarOrCurved, Surface Color Analysis Display For K-Rationalize - Color Analysis Display For K-Rationalize, Surface Importer 2x - Surface Importer Updated, Surface Importer - Surface Importer Node, Surface Laundry - Surface Laundry, Surface Orientation Filter - Face Filter, Surface Slicer - Surface Slicer, Surface.Area Fixer - Surface.Area Fixer, Surface.TangentAtVParameter Fixer - Surface.TangentAtVParameter Fixer, Surface.Thicken Fixer - Surface.Thicken Fixer, Surfaces Prepare For Subregions - Surfaces Prepare For Subregions, Surfaces to Family or Imported - Surfaces to Family or Imported Face To Mass, Synthesize Report a Problem - Synthesize Report a Problem, Topography Auto K-Align Data Prepare - Topography Auto K-Align Data Prepare, Topography Lines of Intersects - Topography Lines of Intersects, Topography Pull Lines Onto Topo - Topography Pull Lines Onto Topo, Topography Scale Points - Generate Scaled Lines, Topography Split Unlock - Topography Split Allow, Topography Stepped Surfaces to Pads - Topography Stepped Surfaces to Pads, Topography Water - Topography Water, Transform Lines and Reference Points Onto Level Origin - Transform Lines and Reference Points Onto Level Origin, Translate BuiltIn Parameter Group - Translate BuiltIn Parameter Group, Try to Hide Elements In Mass Only - Try to Hide Elements, Try Union - Try Union, Underlay Visual Analyse - Underlay Visual Analyse, Understand Faces - Try to Normalize Faces, Understand Quad Faces - Try to Normalize Faces, Unjoin Elements (Smart) - Unjoin Elements (Smart), Update Dynamo Wait - Update Dynamo Wait, Update Revit Wait - Update Revit Wait, UV Grid Lines Connect - UV Grid Lines Connect, UV In All Directions - UV In All Directions, UV Management Emergancy Fix - UV Management Emergancy Fix, UV Management Intersects Function - UV Management Intersects Function, UV Management Loft - Updater - UV Management Loft - Updater, UV Management Loft - UV Management Loft, UV Management Nurbs Curve Function - UV Management Nurbs Curve Function, UV Management - UV Management, Vector of Curve By Points - Vector of Curve By Points, Vector of Model Curve - Vector of Model Curve, View Range Visual Analyse - View Range Visual Analyse, VoroFix - Voronoi Pattern Fix by Karam Baki, VoroFixDesignFace - Voronoi Pattern Fix On Face Design by Karam Baki, Voronoi Function For K-Paneling - Voronoi Function For K-Paneling, Walls By Curves - Walls By Curves, Walls By Profiles - Walls By Curves, ZK.BoundingBox.CenterPoint - Input Bounding Box element to get its center point. This node is little and lightweight, as it doesn't convert bounding box to geometry to get its centroid point., ZK.BoundingBox.Dimensions - Input Bounding Box element to get its dimensions (Width, Length, Height). Setting Boolean switch to True rounds output values., ZK.BoundingBox.Point for Interference Check - ZK.BoundingBox.Point for Interference Check, ZK.Document.GetWarnings - NOTE: Works only with Revit 2018 and above!\r\nGet all warnings from the current document., ZK.Topography.PolySurface - Convert topography element to polysurface","engine_version":"2.6.2.15772","engine":"dynamo","engine_metadata":"","site_url":"https://www.aecedx.com","repository_url":"","contains_binaries":true,"node_libraries":["SynthesizeUnfold, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null","SynthesizeUnfold, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null"],"copyright_holder":null,"copyright_year":null}