{"license":"","file_hash":null,"name":"BIM4Struc.Rebar","version":"1.2.5","description":"The BIM4Struc.Rebar package offers nodes that increase your productivity for Rebar modelling in Revit.\r\nThe nodes don’t only allow you to get data from existing rebar such as sketch lines, geometrical properties, … but they also give access to automation of Rebar tasks (from the API) such as representation settings of rebar, rebar layout rules setting...\r\nCombining these nodes with the rebar creation nodes (from the Dynamo for Rebar package) make it possible to create almost any complex rebar model.\r\n\r\nLook at the \"Extra\" folder for some examples that can be used with the Dynamo Player.\r\n\r\nLearn more at http://revitbeyondbim.wordpress.com","group":"BIM4Struc","keywords":["rebar","reinforcement","bim4struc"],"dependencies":[],"contents":"AreaReinforcement.CreateFromHost - Create Area Reinforcement in a wall or floor according to the wall/floor sketch geometry. The exterior and interior reinforcement are the same by default., Element.GetRebarCover - Get the rebar cover dimensions for a selected element., Layout.DistributionRange - Defines the distribution ranges for rebar sets based on absolute or relative values., PathReinforcement.CreateByCurveAndShapeCode - Create a path reinforcement based on a list of curves and a predefined Rebar Shape Code., PathReinforcement.GetRebar - Get the Rebar objects hosted by a Path Reinforcment, Perpendicular distribution - Node that distributes curves along selected transversal curves (e.g. distribution of longitudinal rebar along transversal rebar segments.), Rebar.CopyByVector - Copy a selected rebar object and copy it according to a list of vectors., Rebar.GetCenterlineCurve - Get the centerline curves from a selected set of rebars, Rebar.GetFullGeometryForView - Generates full geometry for the Rebar for a specific view., Rebar.GetHost - Get the family instance and ID from the host of the selected rebar., Rebar.GetProperties - Get the main properties of a selected array of rebars: Style, Bar Type, Hook Type, Hook Orientation., Rebar.SetDistributionType - Toggle to set the distribution type of a rebar set to \"Varying Length\" (True) or \"Uniform\" (False), Rebar.SetLayoutAsFixedNumber - Sets the Layout Rule property of rebar set to FixedNumber., Rebar.SetLayoutAsMaximumSpacing - Sets the Layout Rule property of rebar set to Maximum Spacing, Rebar.SetLayoutAsMinimumClearSpacing - Sets the Layout Rule property of rebar set to MinimumClearSpacing., Rebar.SetLayoutAsNumberWithSpacing - Sets the Layout Rule property of rebar set to NumberWithSpacing, Rebar.SetLayoutAsSingle - Sets the Layout Rule property of rebar set to Single., Rebar.SetSolidInView - Sets this rebar element to be shown solidly in a 3D view., Rebar.SetUnobscuredInView - Sets this rebar element to be shown unobscured in a view., RebarShape.ByName - Get the Rebar Shape object from Revit, based on the given name., RebarType.GetBarDiameter - Get the diameter of a given Rebar Bar Type, Split curve with overlap - Splits a curve into multiple segments with a maximum length and a gap between two consecutive ones, and create a second curve next to it with similar division and overlap.\r\nThis node is to prepare rebars centerlines with splice lengths. , Trim curves by Surfaces - Trim curves by 2 faces and keep the internal part. ","engine_version":"1.3.0.875","engine":"dynamo","engine_metadata":"","site_url":"http://revitbeyondbim.wordpress.com","repository_url":"","contains_binaries":false,"node_libraries":[]}