{"license":"GPL-3.0","file_hash":null,"name":"Butterfly","version":"0.1.1","description":"Butterfly connects Dynamo to OpenFOAM for CFD simulation. Follow the direction on this page for installation:\r\n\r\nhttps://github.com/ladybug-tools/butterfly/wiki/Getting-started-with-butterfly-in-dynamo\r\n\r\nThere are two example files under extra/examplefiles that you can use to get yourself familiarized with the process. There will be more documentation and tutorials available soon. Open an issue on GitHub for wishes and bugs!","group":"Ladybug Tools","keywords":["cfd;","openfoam"],"dependencies":[{"name":"Ladybug","version":"0.2.1"}],"contents":"blockMesh - blockMesh\r\n-, Boundary - Create a custom boundary.\r\n-, calculated - calculated boundary condition.\r\n-, chekMesh - chekMesh\r\n-, controlDict - Set parameters for runDict, Create Butterfly Geometry - Create Butterfly surface.\r\n-, Create Case from Folder - Create an OpenFOAM Case from an existing case in a local folder.\r\n-, Create Case from Geometries - Create an OpenFOAM Case from geometries.\r\n-, Create Case from Tunnel - Create Case from wind tunnel.\r\n-, decomposeParDict scotch - Scotch decomposeParDict. Dictionary for parallel runs.\r\n-, decomposeParDict simple - Simple decomposeParDict. Dictionary for parallel runs.\r\n-, DistanceRefinementMode - Inside/Ouside region refinement.\r\n-, divSchemes library - Generate fvSchemes based on mesh non-orthogonalities.\r\n-, epsilonWallFunction - epsilonWallFunction boundary condition.\r\n-, fixedValue - fixedValue boundary condition.\r\n-, Function Object - Function Object., FvSchemes from Non-orthogonality - Generate fvSchemes based on mesh non-orthogonalities.\r\n-, Get Geometry - Update fvSchemes values based on mesh orthogonalities.\r\n-, Grading XYZ - MultiGrading\r\nCreate a grading for multiple segmentGradings.\r\n-, Heat Transfer Recipe - Heat Transfer Recipe.\r\n-, Inlet Boundary - Create an inlet boundary with uniform velocity value.\r\n-, Inlet Flow-Rate Boundary - Create an inlet boundary with flow rate in m3/s.\r\n-, kqRWallFunction - kqRWallFunction boundary condition.\r\n-, Laminar Turbulance Model - Large eddy simulation (LES) modelling.\r\nRead more: http://cfd.direct/openfoam/user-guide/turbulence/\r\nWatch this: https://www.youtube.com/watch?v=Eu_4ppppQmw, LES Turbulance Model - Large eddy simulation (LES) modelling.\r\nRead more: http://cfd.direct/openfoam/user-guide/turbulence/\r\nWatch this: https://www.youtube.com/watch?v=Eu_4ppppQmw, Load Mesh - Load mesh from the case for preview.\r\n-, Load Points - Load points from the case for preview.\r\n-, Load Probes Value - Load results for a field in probes.\r\n-, Load Probes - Load probes from a folder.\r\n-, Load Skipped Probes - Load results for a field in probes.\r\n-, LocationRefinementMode - Inside/Ouside region refinement.\r\n-, Look Up Case Folder - Look Up Case Folder.\r\n-, Make2d Parameters - Make a case 2d., Meshing Parameters - Set meshing parameters for blockMesh and snappyHexMesh., MultiGrading - MultiGrading\r\nCreate a grading for multiple segmentGradings.\r\n-, nutkWallFunction - nutkWallFunction boundary condition.\r\n-, Outlet Boundary - Create an outlet boundary with uniform pressure value.\r\n-, Plot Residuals - Load residual values for a case.\r\n-, probes - Create Butterfly probes, purgeCase - Purge case folder.\r\n-, RAS Turbulance Model - Reynolds-averaged simulation (RAS) turbulence model.\r\nRead more: http://cfd.direct/openfoam/user-guide/turbulence/\r\nWatch this: https://www.youtube.com/watch?v=Eu_4ppppQmw, Refinement Region - Butterfly refinement range.\r\n-, relaxtionFactors - Set relaxtionFactors values, residualControl - Set residual control convergance values, Sample Case - Sample the results for a case.\r\nUse this component yo load the results for a case that you have ran already. \r\n-, Segment Grading - Segment Grading.\r\nUse this component to create a grading for a segment of the block based on ratio\r\nor length.\r\n-, snappyHexMesh - snappyHexMesh\r\n-, snappyHexMeshDict - Set parameters for snappyHexMeshDict.\r\nRead more about snappyHexMeshDict here:\r\n    https://openfoamwiki.net/images/f/f0/Final-AndrewJacksonSlidesOFW7.pdf, Solution Parameter - Solution Parameter., Solution Parameters - Solution Parameters., Solution - Run recipes using OpenFOAM.\r\n-, Steady Incompressible Recipe - Steady Incompressible Recipe.\r\n-, Update blockMeshDict - Update blockMeshDict.\r\n-, Visualize Vectors - Visualize vectors, Wall Boundary - Create a wall boundary.\r\n-, Wind Tunnel Parameters - Wind tunnel parameters.\r\n-, Wind Vector - Wind vector.\r\n-, zeroGradient - zeroGradient boundary condition.\r\n-","engine_version":"2.0.1.5065","engine":"dynamo","engine_metadata":"","site_url":"ladybug.tools","repository_url":"https://github.com/ladybug-tools/butterfly","contains_binaries":false,"node_libraries":[]}