{"license":"","file_hash":null,"name":"DynaFabrication2017","version":"0.1.13","description":"Nodes for fabrication within Revit.  Requires a fabrication database.  Only been tested in Revit 2017 and Dynamo 1.x.  Check back often as more nodes will get added as time permits.  Please send comments/feedback to nchapman@generalheating.com","group":"","keywords":["fabrication","bim","fab"],"dependencies":[],"contents":"Align Part By Connectors and Couple - Align parts by specified connectors.  Will couple if Boolean set to True, Application Information - Get information about the current Revit setup, Clear Design Selection - RME to FAB clear design lines.  If node doesnt work execute the button manualy and look in the journal file.  You will see something like this  Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%Add-Ins%RME to FAB%Clear Design Selection:RVTFabExchange.ClearDesignLineElementsCmd\". Take inbetween the first : and next : and put in string in node., Clear Graphics Selection - RME to FAB clear graphics.  If node doesnt work execute the button manualy and look in the journal file.  You will see something like this  Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%Add-Ins%RME to FAB%Clear Graphics Selection:RVTFabExchange.ClearGraphicsElementsCmd\". Take inbetween the first : and next : and put in string in node., Connector(s) Information - Gets the connector(s) information.  Can be used with both fabrication and non fabrication connector(s).  Owner name and ID only work for non fabrication items., Create Fabrication Part (Button) - Create fabricatin part based off doc, servicebutton, condition and level.  Places at 0,0,0., Design To Fabrication Converter - Convert design elements to fabrication parts, Dropdown List - No description provided, Export Fabrication Job - Export selected items to MAJ , Export - RME to FAB Export. If node doesnt work execute the button manualy and look in the journal file.  You will see something like this   Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%Add-Ins%RME to FAB%Out:RVTFabExchange.ExportCmd\". Take inbetween the first : and next : and put in string in node., Fabrication Specification Dropdown List - Dropdown list of all specifications , Get All Fabrication Configuration(s) - Gets all the fabrication configurations in the current document., Get All Fabrication Connector(s) - Gets all the Connector(s) in the configuration, Get All Fabrication Service(s) - Get all fabrication services in loaded configuration, Get All Loaded Fabrication Service(s) - Get all loaded services in document, Get Fabrication Configuration Info - Get loaded fabriation configuration information (Name, Path and Profile), Get Fabrication Insulation Specification(s) - Sets fabrication part bases of connector, Get Fabrication Material Thickness(s) - Get the materials gauge thicknesses, Get Fabrication Material(s) Information - Get fabrication material information, Get Fabrication Service Group Button(s) - Get the button name and identifier of the specific service and group, Get Fabrication Service Group(s) - Gets the group(s) Name and ID associated with the service., Get Fabrication Specification(s) - Get all fabrication specification(s), Import Fabrication Job - Import MAJ file, Journal File Comment - Add a comment to the journal file, Load Fabrication Service(s) - Load fabrication service(s) into document, Loaded Applications - Get all loaded applications, Optimize Fabrication Part(s) Length - Optimize fabrication part(s) Length, Part(s) CID Number - Get the CID number, Part(s) Current Product List Entry - Get the current Product list entry for the part(s), Part(s) Product List Entry(s) - Get the part(s) product list entry index and name, Reposition Fabrication Part - Swaps selected end part with opposite end part., RevitLookup Snoop Active View - Using RevitLookup, snoop Revit's active view.  RevitLookup must be installed for this to work. If node doesnt work execute the button manualy and look in the journal file.  You will see something like this J  Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%CustomCtrl_%Add-Ins%Revit Lookup%Options%Snoop Active View...:RevitLookup.CmdSnoopActiveView\". Take inbetween the first : and next : and put in string in node., RevitLookup Snoop Application - Using RevitLookup, snoop Revit's application.  RevitLookup must be installed for this to work. If node doesnt work execute the button manualy and look in the journal file.  You will see something like this J   Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%CustomCtrl_%Add-Ins%Revit Lookup%Options%Snoop Current Selection...:RevitLookup.CmdSnoopModScope\". Take inbetween the first : and next : and put in string in node., RevitLookup Snoop Current Selection - Using RevitLookup, snoop Revit's current selection.  RevitLookup must be installed for this to work. If node doesnt work execute the button manualy and look in the journal file.  You will see something like this J    Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%CustomCtrl_%Add-Ins%Revit Lookup%Options%Snoop Current Selection...:RevitLookup.CmdSnoopModScope\". Take inbetween the first : and next : and put in string in node., RevitLookup Snoop DB - Using RevitLookup snoop Revit's DB.  RevitLookup must be installed for this to work. If node doesnt work execute the button manualy and look in the journal file.  You will see something like this J Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%CustomCtrl_%Add-Ins%Revit Lookup%Options%Snoop Db..:RevitLookup.CmdSnoopDb\". Take inbetween the first : and next : and put in string in node., Rotate Part By Connector - Rotates part about connector a specified angle. Rectangular/Oval angles are limited to 90,180,270. Taps can't be rotated., Rotate Tap By Connector - Rotate a tap about a connector, Set Fabrication Configuration (Global) - Set fabrication configuration with Global profile, Set Fabrication Configuration (Specific) - Sets fabrication configuration with specific profile, Set Fabrication Position By End - Sets fabrication part bases of connector, Set Fabrication Specification - Sets the fabrication specification based on ID, Set Library Path(s) - Set the library path(s), Set Shared Parameter File - Set the shared parameter file, Store Design Line Elements - RME to FAB store design lines.  If node doesnt work execute the button manualy and look in the journal file.  You will see something like this Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%Add-Ins%RME to FAB%Store Design Line Elements:RVTFabExchange.StoreDesignLineElementsCmd\". Take inbetween the first : and next : and put in string in node., Store Graphics Elements - RME to FAB graphics elements.  If node doesnt work execute the button manualy and look in the journal file.  You will see something like this  Jrn.RibbonEvent \"Execute external command:CustomCtrl_%CustomCtrl_%Add-Ins%RME to FAB%Store Graphics Elements:RVTFabExchange.StoreGraphicsElementsCmd\". Take inbetween the first : and next : and put in string in node., Unload Fabrication Service(s) - Unload fabrication service(s) from document","engine_version":"1.0.0.1180","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"","contains_binaries":false,"node_libraries":[]}